Revit 2027 API
CompoundStructure.SplitRegion Method
Overload List
Name | Description
SplitRegion(UV, RectangularGridSegmentOrientation) |  Splits the region which contains the specified grid point by a line with the specified direction.
SplitRegion(UV, RectangularGridSegmentOrientation, Int32) |  Splits the region which contains the specified grid point by a line with the specified direction.
Top
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace